{
  "Id":"d42c8f31-053a-447b-a07e-89c207b35739",
  "Title":"Why not?!",
  "Text":"Welcome to my humble space on the internet, where I intend to post mostly about (web)development, mostly about .NET. But I may also post about other passions of mine, both older and newer. You may also find some posts dedicated to share deep reflections on random topics...\n\nOnce again, welcome to my space! My name is Leandro Gabriel, I\u0027m an Electrical Engineer passionate by technology and development. I love to understand how things work, which led me to a very peculiar work path. Since this is my first bog post, it only seems fair to introduce myself and let you know a little bit of my background, some struggles and some achievements. Sit tight and let\u0027s start. \n\n## Achievements\n\nImagine you need to land a job in IT, you love coding, you need to finish a Master Thesis, your native language is Portuguese (yeah, I\u0027m Brazilian/Portuguese, but I\u0027 talk more about this in another opportunity), you have two kids studying from home due to COVID-19 restrictions.\n\nI discovered a Low-Code platform, Outsystems, enrolled in 2 different courses (2 week each), and tried a job as a Support Engineer. And there I was, working as Support Engineer, communicating in English with clients from Germany, South Africa, US, Ireland, and with coworkers from Singapore, Japan and Malaysia. Every official communication should also be in English, even with local coworkers, from Portugal.\n\nDuring this time, I also had to develop an application for my Master\u0027s in Biomedical Engineering, a project that I\u0027m deeply proud of, MPTHub ([https://github.com/lassisg/mpthub](https://github.com/lassisg/mpthub)). Knowing you are helping researchers in their advances with health science is priceless. This deserves a blog post on it\u0027s own.\n\nAfter that period, I\u0027ve com to a somewhat dark period, and had to focus only on study before getting back to a real paying job. So let\u0027s talk about some struggles I\u0027ve been facing... \n\n## Struggles\n\nBack in Brazil, I had to enroll in an English school on Saturday mornings, paying with my own money during internship in Engineering. I\u0027ve gone through the course, completed it in five years and, yet, wasn\u0027t even near a secure english speaker. You see, I\u0027m a damn perfectionist. I see other\u0027s mistakes and don\u0027t want to make then. So I do what I do best: avoid the risk of failure.\n\nThis hit me hard at Outsystems. The lack of confidence to communicate restrained my ability to call clients and  solve issues faster. The pressure made me lack focus on analysis. I was not ready to face the challenge. I loved working there, people were amazing, work was fantastic, tons to learn. But I was just too scared to risk talking less then perfectly to the clients. Too insecure to send an email without seeking validation from peers.\n\nSee, I\u0027ve been fighting depression for over 3 years, over complicating things, underestimating my efforts, comparing myself with top professionals with over a decade of experience in the industry. I was not being fair with myself. \n\nAnd this struggle of \u0022not being good enough\u0022 kept hitting me hard.\n\n## Setbacks\n\nFast forward to the end of 2020, my Master\u0027s Degree was finished and I could\u0027n land a job. So I figured I should get educated in some technical stack. Right before a C# course started, I got a job offer.\n\nDuring the first year, I was working as a Support Engineer for internal applications developed in Outsystems by day. And taking classes on SQL Server, C#, HTML, CSS, JavaScript and Angular at night. It wasn\u0027t good for my family, but I had to go through this, I would let me finally get a proper job as a developer.\n\nI nailed it! I was the top student, with the highest grade in the course. And when it ended, I switched projects within my company to work in an inside project. That was the best professional year in my life. I learned a lot more than I could dream of, working as a back-end developer with .NET.\n\nBut the lack of confidence stroke again. Sometimes I would take too long to deliver a task just because I had this idea that I should know a topic. This led me to take too much time reading and watching videos instead of just asking. Don\u0027t give me wrong, I was all in for each and every assigned task, I just kept falling... And getting back up!\n\n## Why not?!\n\nAfter being laid off from the last job, it hit me again... Once more I felt not good enough. It felt like I\u0027ve been missing knowledge. There seemed to be some connection missing between all I ever learned.\n\nOn the other hand, I felt capable of doing what was needed. But companies don\u0027t really care... They want prove, they need to reduce their risks. It\u0027s reasonable. After all, any employee is an asset, an investment of time and money (and time IS money).\n\nI decided to start my own journey, think of product and develop it! But then, where to start? I idealized an application and took a course in Entrepreneurship. Now it is up to me to make it happen. I started thing in everything as I could imagine. But I always ended up being overwhelmed by the amount of things I would need to master before launching the app...\n\nAfter over an year, I realized I don\u0027t really need to master anything! Why not launch the product with a minimal standard? Why not publish it and then, after live, improve it? Why not start right now? Why wait perfection? Perfection is an illusion!\n\n## The right time\n\nThat was when I finally realized! I don\u0027t need to way the right time to build it! I don\u0027t need it to be as I planned right from first deployment! Windows is buggy since its launching and continues to be! Several other apps are far from perfect! Even more importantly, what seems to be perfect for an app today, may not be considered ideal in the future. Requirements change (all the time).\n\nSo the best time to start is yesterday! The second best moment to start is now!\n\n## Final thoughts\n\nWrapping up, I\u0027m here to share my stories, my struggles, to expose myself. I\u0027m here to document my projects, my advances, my set backs. I don\u0027t know what would be the posts schedule, I\u0027ll post whenever I want, with no pressure to post daily, weekly or monthly.\n\nBut I will post what is in my mind, with honesty.\n\nThanks for reading. :)",
  "PublishDate":"2025-06-16T00:00:00",
  "Category":{
    "Id":"f23ad71a-6b8c-4f25-9e0f-667211bf29df",
    "Name":"Reflections"
  },
  "Tags":[
    {
      "Id":"3cf5fae0-03b0-437c-9189-ad1940236d6e",
      "Name":"Blazor"
    },
    {
      "Id":"39662e48-aeb8-4e16-bc9d-3ec1543098f8",
      "Name":"Development"
    }
  ]
}